<template>
	<div class="">
		<v-container fluid style="background: #f5f7f8">
			<v-container class="my-4">
				<v-row class="pa-0">
					<v-col cols="12" lg="9" class="pa-0 ma-0 pa-sm-3">
						<header-skider />
					</v-col>
					<v-col cols="12" lg="3">
						<v-card>
							<v-subheader class="text-h5 font-weight-medium mb-4 pt-5"> Товар Дня </v-subheader>
							<v-divider class="d-lg-none mb-3"></v-divider>
							<cardItem
						/></v-card>
					</v-col>
				</v-row>
				<v-row>
					<v-list
						class="d-none d-lg-flex"
						color="transparent"
						style="gap: 25px; width: 100%"
						line-two
					>
						<v-list-item class="white">
							<v-list-item-avatar
								><svg
									width="50"
									height="50"
									viewBox="0 0 50 50"
									fill="none"
									xmlns="http://www.w3.org/2000/svg"
								>
									<path
										d="M20.7149 6.65837C23.4512 6.03384 26.293 6.03384 29.0292 6.65837C31.7655 7.28291 34.3259 8.51592 36.5202 10.2658C38.7145 12.0157 40.4863 14.2375 41.7041 16.7662C42.9218 19.2949 43.5542 22.0655 43.5542 24.8721C43.5542 27.6787 42.9218 30.4493 41.7041 32.9779C40.4863 35.5066 38.7145 37.7284 36.5202 39.4783C34.3259 41.2282 31.7655 42.4612 29.0292 43.0858C26.293 43.7103 23.4512 43.7103 20.7149 43.0858C17.9787 42.4612 15.4183 41.2282 13.224 39.4783C11.0297 37.7284 9.25783 35.5066 8.04008 32.9779C6.82233 30.4493 6.18997 27.6787 6.18997 24.8721C6.18997 22.0655 6.82234 19.2949 8.04008 16.7662C9.25783 14.2375 11.0297 12.0157 13.224 10.2658C15.4183 8.51592 17.9787 7.28291 20.7149 6.65837Z"
										stroke="#010101"
										stroke-width="3.33333"
									/>
									<path
										d="M19.66 32V18H25.72C26.9733 18 28.0533 18.2067 28.96 18.62C29.8667 19.02 30.5667 19.6 31.06 20.36C31.5533 21.12 31.8 22.0267 31.8 23.08C31.8 24.12 31.5533 25.02 31.06 25.78C30.5667 26.5267 29.8667 27.1 28.96 27.5C28.0533 27.9 26.9733 28.1 25.72 28.1H21.46L22.9 26.68V32H19.66ZM28.56 32L25.06 26.92H28.52L32.06 32H28.56ZM22.9 27.04L21.46 25.52H25.54C26.54 25.52 27.2867 25.3067 27.78 24.88C28.2733 24.44 28.52 23.84 28.52 23.08C28.52 22.3067 28.2733 21.7067 27.78 21.28C27.2867 20.8533 26.54 20.64 25.54 20.64H21.46L22.9 19.1V27.04Z"
										fill="#010101"
									/>
								</svg>
							</v-list-item-avatar>
							<v-list-item-content>
								<v-list-item-title class="text-wrap">
									Только оригинальная продукция
								</v-list-item-title>
							</v-list-item-content>
						</v-list-item>

						<v-list-item class="white">
							<v-list-item-avatar
								><svg
									width="50"
									height="50"
									viewBox="0 0 50 50"
									fill="none"
									xmlns="http://www.w3.org/2000/svg"
								>
									<g clip-path="url(#clip0_2283_7280)">
										<path
											d="M48.4947 12.2505C48.4533 11.8304 48.3062 11.4277 48.0673 11.0802C47.8284 10.7326 47.5054 10.4515 47.1286 10.2632L27.1858 0.264263C26.8395 0.0904793 26.4576 0 26.0703 0C25.683 0 25.3011 0.0904793 24.9547 0.264263L5.01195 10.2632C4.63622 10.4526 4.31424 10.734 4.07587 11.0814C3.8375 11.4288 3.69045 11.8309 3.64837 12.2505C3.62095 12.518 1.25274 39.1652 25.0594 49.7816C25.3775 49.9256 25.7225 50 26.0715 50C26.4205 50 26.7655 49.9256 27.0836 49.7816C50.8903 39.1652 48.5221 12.5205 48.4947 12.2505Z"
											fill="#4633B9"
										/>
										<path
											d="M48.4947 12.2505C48.4533 11.8304 48.3062 11.4277 48.0673 11.0802C47.8284 10.7326 47.5054 10.4515 47.1286 10.2632L27.1858 0.264263C26.8395 0.0904793 26.4576 0 26.0703 0C25.683 0 25.3011 0.0904793 24.9547 0.264263L5.01195 10.2632C4.63622 10.4526 4.31424 10.734 4.07587 11.0814C3.8375 11.4288 3.69045 11.8309 3.64837 12.2505C3.62095 12.518 1.25274 39.1652 25.0594 49.7816C25.3775 49.9256 25.7225 50 26.0715 50C26.4205 50 26.7655 49.9256 27.0836 49.7816C50.8903 39.1652 48.5221 12.5205 48.4947 12.2505Z"
											fill="#1767F9"
										/>
										<path
											d="M48.4947 12.2505C48.4533 11.8304 48.3062 11.4277 48.0673 11.0802C47.8284 10.7326 47.5054 10.4515 47.1286 10.2632L27.1858 0.264263C26.8395 0.0904793 26.4576 0 26.0703 0C25.683 0 25.3011 0.0904793 24.9547 0.264263L5.01195 10.2632C4.63622 10.4526 4.31424 10.734 4.07587 11.0814C3.8375 11.4288 3.69045 11.8309 3.64837 12.2505C3.62095 12.518 1.25274 39.1652 25.0594 49.7816C25.3775 49.9256 25.7225 50 26.0715 50C26.4205 50 26.7655 49.9256 27.0836 49.7816C50.8903 39.1652 48.5221 12.5205 48.4947 12.2505Z"
											fill="#4BB1BC"
										/>
										<path
											d="M48.4947 12.2505C48.4533 11.8304 48.3062 11.4277 48.0673 11.0802C47.8284 10.7326 47.5054 10.4515 47.1286 10.2632L27.1858 0.264263C26.8395 0.0904793 26.4576 0 26.0703 0C25.683 0 25.3011 0.0904793 24.9547 0.264263L5.01195 10.2632C4.63622 10.4526 4.31424 10.734 4.07587 11.0814C3.8375 11.4288 3.69045 11.8309 3.64837 12.2505C3.62095 12.518 1.25274 39.1652 25.0594 49.7816C25.3775 49.9256 25.7225 50 26.0715 50C26.4205 50 26.7655 49.9256 27.0836 49.7816C50.8903 39.1652 48.5221 12.5205 48.4947 12.2505Z"
											fill="url(#paint0_radial_2283_7280)"
										/>
										<path
											d="M48.4947 12.2505C48.4533 11.8304 48.3062 11.4277 48.0673 11.0802C47.8284 10.7326 47.5054 10.4515 47.1286 10.2632L27.1858 0.264263C26.8395 0.0904793 26.4576 0 26.0703 0C25.683 0 25.3011 0.0904793 24.9547 0.264263L5.01195 10.2632C4.63622 10.4526 4.31424 10.734 4.07587 11.0814C3.8375 11.4288 3.69045 11.8309 3.64837 12.2505C3.62095 12.518 1.25274 39.1652 25.0594 49.7816C25.3775 49.9256 25.7225 50 26.0715 50C26.4205 50 26.7655 49.9256 27.0836 49.7816C50.8903 39.1652 48.5221 12.5205 48.4947 12.2505Z"
											fill="url(#paint1_radial_2283_7280)"
											fill-opacity="0.5"
										/>
										<path
											d="M48.4947 12.2505C48.4533 11.8304 48.3062 11.4277 48.0673 11.0802C47.8284 10.7326 47.5054 10.4515 47.1286 10.2632L27.1858 0.264263C26.8395 0.0904793 26.4576 0 26.0703 0C25.683 0 25.3011 0.0904793 24.9547 0.264263L5.01195 10.2632C4.63622 10.4526 4.31424 10.734 4.07587 11.0814C3.8375 11.4288 3.69045 11.8309 3.64837 12.2505C3.62095 12.518 1.25274 39.1652 25.0594 49.7816C25.3775 49.9256 25.7225 50 26.0715 50C26.4205 50 26.7655 49.9256 27.0836 49.7816C50.8903 39.1652 48.5221 12.5205 48.4947 12.2505Z"
											fill="url(#paint2_linear_2283_7280)"
										/>
										<path
											d="M43.5135 14.2333L43.5139 14.2381L43.5139 14.2381C43.5154 14.2546 44.0057 19.7789 42.0764 26.3621C40.1556 32.9163 35.8733 40.4271 26.3607 44.7222L26.3523 44.726C26.3002 44.7499 26.2449 44.7618 26.1897 44.7618C26.1345 44.7618 26.0792 44.7499 26.0272 44.726L26.0188 44.7222C16.5062 40.4271 12.2239 32.9158 10.303 26.3613C8.37909 19.7962 8.86139 14.2846 8.8653 14.2399L8.86533 14.2396L8.86568 14.236C8.87409 14.1512 8.90335 14.0716 8.94873 14.0046L7.56904 13.0696L8.94874 14.0046C8.99379 13.9382 9.05266 13.887 9.11803 13.8534C9.11836 13.8532 9.1187 13.8531 9.11904 13.8529L25.9987 5.28394L25.9992 5.28369C26.0592 5.25319 26.124 5.23796 26.1887 5.23796C26.2533 5.23796 26.3181 5.25319 26.3781 5.28369L26.3786 5.28394L43.2614 13.8545L43.2633 13.8555C43.3282 13.8883 43.3868 13.9388 43.4315 14.0047L44.8105 13.0686L43.4316 14.0048C43.4764 14.0708 43.5053 14.1494 43.5135 14.2333Z"
											stroke="#FFC530"
											stroke-width="3.33333"
										/>
										<path
											d="M41.851 14.9595L41.8515 14.9642L41.8515 14.9646C41.8562 15.02 42.2941 20.1452 40.5338 26.2469C38.7732 32.3499 34.8537 39.3237 26.1621 43.3103L26.1537 43.3143C26.1253 43.3275 26.0969 43.3333 26.0698 43.3333C26.0427 43.3333 26.0143 43.3275 25.986 43.3143L25.986 43.3143L25.9775 43.3104C17.286 39.3237 13.3665 32.3495 11.6059 26.2462C9.84841 20.154 10.2821 15.0358 10.288 14.9664L10.288 14.9657L10.2884 14.9622C10.2948 14.8967 10.3168 14.8376 10.3486 14.79C10.3799 14.7431 10.4183 14.7106 10.4564 14.6907C10.4567 14.6905 10.4569 14.6904 10.4572 14.6902L25.9651 6.6927L25.9656 6.69245C26.0002 6.67459 26.0354 6.66667 26.0689 6.66667C26.1023 6.66667 26.1375 6.67459 26.1721 6.69245L26.1726 6.6927L41.6836 14.6919L41.6856 14.6929C41.723 14.7121 41.7609 14.7438 41.7919 14.7902C41.8231 14.8369 41.8448 14.895 41.851 14.9595Z"
											stroke="black"
											stroke-width="3.33333"
										/>
										<path
											d="M18.5703 22.9927L24.373 28.334L35.237 18.334"
											stroke="black"
											stroke-width="3.33333"
										/>
									</g>
									<defs>
										<radialGradient
											id="paint0_radial_2283_7280"
											cx="0"
											cy="0"
											r="1"
											gradientUnits="userSpaceOnUse"
											gradientTransform="translate(30.5715 36.9048) rotate(114.616) scale(28.8087 31.8449)"
										>
											<stop stop-color="#FF8A1E" />
											<stop offset="1" stop-color="#EF4141" />
										</radialGradient>
										<radialGradient
											id="paint1_radial_2283_7280"
											cx="0"
											cy="0"
											r="1"
											gradientUnits="userSpaceOnUse"
											gradientTransform="translate(25.5953 25.5952) rotate(-154.269) scale(54.8427 69.4335)"
										>
											<stop stop-color="#FFA901" />
											<stop offset="1" stop-color="#FFC701" stop-opacity="0" />
										</radialGradient>
										<linearGradient
											id="paint2_linear_2283_7280"
											x1="40.9993"
											y1="2.32674e-06"
											x2="-0.13638"
											y2="69.5541"
											gradientUnits="userSpaceOnUse"
										>
											<stop stop-color="#FFDF35" />
											<stop offset="1" stop-color="#FF8A01" stop-opacity="0" />
										</linearGradient>
										<clipPath id="clip0_2283_7280">
											<rect width="50" height="50" fill="white" />
										</clipPath>
									</defs>
								</svg>
							</v-list-item-avatar>
							<v-list-item-content>
								<v-list-item-title class="text-wrap">
									1 год официальной гарантии
								</v-list-item-title>
							</v-list-item-content>
						</v-list-item>

						<v-list-item class="white">
							<v-list-item-avatar
								><svg
									width="50"
									height="50"
									viewBox="0 0 50 50"
									fill="none"
									xmlns="http://www.w3.org/2000/svg"
								>
									<g clip-path="url(#clip0_2283_7300)">
										<path
											d="M20.3439 5.03362C23.3243 4.35338 26.4196 4.35338 29.4 5.03362C32.3804 5.71387 35.1692 7.05689 37.5592 8.9629C39.9493 10.8689 41.8792 13.2889 43.2056 16.0432C44.532 18.7975 45.2207 21.8152 45.2207 24.8722C45.2207 27.9292 44.532 30.9469 43.2056 33.7012C41.8792 36.4555 39.9493 38.8755 37.5592 40.7815C35.1691 42.6875 32.3804 44.0305 29.4 44.7108C26.4196 45.391 23.3243 45.391 20.3439 44.7108C17.3636 44.0305 14.5748 42.6875 12.1847 40.7815C9.79465 38.8755 7.86474 36.4555 6.53836 33.7012C5.21197 30.9469 4.52319 27.9292 4.52319 24.8722C4.52319 21.8152 5.21197 18.7975 6.53836 16.0432C7.86474 13.2889 9.79465 10.8689 12.1847 8.9629C14.5748 7.05689 17.3636 5.71387 20.3439 5.03362Z"
											fill="#010101"
										/>
										<rect width="22" height="22" transform="matrix(-1 0 0 1 36 14)" fill="white" />
									</g>
									<defs>
										<clipPath id="clip0_2283_7300">
											<rect width="50" height="50" fill="white" />
										</clipPath>
									</defs>
								</svg>
							</v-list-item-avatar>
							<v-list-item-content>
								<v-list-item-title class="text-wrap">
									Собственный сервисный центр
								</v-list-item-title>
							</v-list-item-content>
						</v-list-item>
						<v-list-item class="white" line-two>
							<v-list-item-avatar
								><svg
									width="50"
									height="50"
									viewBox="0 0 50 50"
									fill="none"
									xmlns="http://www.w3.org/2000/svg"
								>
									<g clip-path="url(#clip0_2283_7309)">
										<path
											d="M36.8057 43.7826L44.8289 43.0293L39.7575 32.1536L26.713 40.0978L31.0714 49.4445L36.8057 43.7826Z"
											fill="#4633B9"
										/>
										<path
											d="M36.8057 43.7826L44.8289 43.0293L39.7575 32.1536L26.713 40.0978L31.0714 49.4445L36.8057 43.7826Z"
											fill="#1767F9"
										/>
										<path
											d="M36.8057 43.7826L44.8289 43.0293L39.7575 32.1536L26.713 40.0978L31.0714 49.4445L36.8057 43.7826Z"
											fill="url(#paint0_radial_2283_7309)"
										/>
										<path
											d="M36.8057 43.7826L44.8289 43.0293L39.7575 32.1536L26.713 40.0978L31.0714 49.4445L36.8057 43.7826Z"
											fill="url(#paint1_radial_2283_7309)"
											fill-opacity="0.5"
										/>
										<path
											d="M36.8057 43.7826L44.8289 43.0293L39.7575 32.1536L26.713 40.0978L31.0714 49.4445L36.8057 43.7826Z"
											fill="url(#paint2_linear_2283_7309)"
										/>
										<path
											d="M36.8057 43.7826L44.8289 43.0293L39.7575 32.1536L26.713 40.0978L31.0714 49.4445L36.8057 43.7826Z"
											fill="url(#paint3_linear_2283_7309)"
										/>
										<path
											d="M12.6514 43.7826L4.62814 43.0293L9.69956 32.1536L22.7441 40.0978L18.3856 49.4445L12.6514 43.7826Z"
											fill="#4633B9"
										/>
										<path
											d="M12.6514 43.7826L4.62814 43.0293L9.69956 32.1536L22.7441 40.0978L18.3856 49.4445L12.6514 43.7826Z"
											fill="#1767F9"
										/>
										<path
											d="M12.6514 43.7826L4.62814 43.0293L9.69956 32.1536L22.7441 40.0978L18.3856 49.4445L12.6514 43.7826Z"
											fill="#4BB1BC"
										/>
										<path
											d="M12.6514 43.7826L4.62814 43.0293L9.69956 32.1536L22.7441 40.0978L18.3856 49.4445L12.6514 43.7826Z"
											fill="url(#paint4_radial_2283_7309)"
										/>
										<path
											d="M12.6514 43.7826L4.62814 43.0293L9.69956 32.1536L22.7441 40.0978L18.3856 49.4445L12.6514 43.7826Z"
											fill="url(#paint5_radial_2283_7309)"
											fill-opacity="0.5"
										/>
										<path
											d="M12.6514 43.7826L4.62814 43.0293L9.69956 32.1536L22.7441 40.0978L18.3856 49.4445L12.6514 43.7826Z"
											fill="url(#paint6_linear_2283_7309)"
										/>
										<path
											d="M12.6514 43.7826L4.62814 43.0293L9.69956 32.1536L22.7441 40.0978L18.3856 49.4445L12.6514 43.7826Z"
											fill="url(#paint7_linear_2283_7309)"
										/>
										<path
											d="M19.9383 0.51349C22.9408 -0.171814 26.0592 -0.171814 29.0617 0.51349C32.0642 1.19879 34.8737 2.55179 37.2815 4.47197C39.6894 6.39214 41.6336 8.83016 42.9699 11.6049C44.3061 14.3796 45 17.4198 45 20.4995C45 23.5792 44.3061 26.6194 42.9699 29.3941C41.6336 32.1689 39.6894 34.6069 37.2815 36.5271C34.8737 38.4472 32.0642 39.8002 29.0617 40.4855C26.0592 41.1708 22.9408 41.1708 19.9383 40.4855C16.9358 39.8002 14.1263 38.4472 11.7185 36.5271C9.31063 34.6069 7.36638 32.1689 6.03014 29.3941C4.6939 26.6194 4 23.5792 4 20.4995C4 17.4198 4.6939 14.3796 6.03014 11.6049C7.36638 8.83016 9.31063 6.39214 11.7185 4.47197C14.1263 2.55179 16.9358 1.19879 19.9383 0.51349Z"
											fill="#4633B9"
										/>
										<path
											d="M19.9383 0.51349C22.9408 -0.171814 26.0592 -0.171814 29.0617 0.51349C32.0642 1.19879 34.8737 2.55179 37.2815 4.47197C39.6894 6.39214 41.6336 8.83016 42.9699 11.6049C44.3061 14.3796 45 17.4198 45 20.4995C45 23.5792 44.3061 26.6194 42.9699 29.3941C41.6336 32.1689 39.6894 34.6069 37.2815 36.5271C34.8737 38.4472 32.0642 39.8002 29.0617 40.4855C26.0592 41.1708 22.9408 41.1708 19.9383 40.4855C16.9358 39.8002 14.1263 38.4472 11.7185 36.5271C9.31063 34.6069 7.36638 32.1689 6.03014 29.3941C4.6939 26.6194 4 23.5792 4 20.4995C4 17.4198 4.6939 14.3796 6.03014 11.6049C7.36638 8.83016 9.31063 6.39214 11.7185 4.47197C14.1263 2.55179 16.9358 1.19879 19.9383 0.51349Z"
											fill="#1767F9"
										/>
										<path
											d="M19.9383 0.51349C22.9408 -0.171814 26.0592 -0.171814 29.0617 0.51349C32.0642 1.19879 34.8737 2.55179 37.2815 4.47197C39.6894 6.39214 41.6336 8.83016 42.9699 11.6049C44.3061 14.3796 45 17.4198 45 20.4995C45 23.5792 44.3061 26.6194 42.9699 29.3941C41.6336 32.1689 39.6894 34.6069 37.2815 36.5271C34.8737 38.4472 32.0642 39.8002 29.0617 40.4855C26.0592 41.1708 22.9408 41.1708 19.9383 40.4855C16.9358 39.8002 14.1263 38.4472 11.7185 36.5271C9.31063 34.6069 7.36638 32.1689 6.03014 29.3941C4.6939 26.6194 4 23.5792 4 20.4995C4 17.4198 4.6939 14.3796 6.03014 11.6049C7.36638 8.83016 9.31063 6.39214 11.7185 4.47197C14.1263 2.55179 16.9358 1.19879 19.9383 0.51349Z"
											fill="#4BB1BC"
										/>
										<path
											d="M19.9383 0.51349C22.9408 -0.171814 26.0592 -0.171814 29.0617 0.51349C32.0642 1.19879 34.8737 2.55179 37.2815 4.47197C39.6894 6.39214 41.6336 8.83016 42.9699 11.6049C44.3061 14.3796 45 17.4198 45 20.4995C45 23.5792 44.3061 26.6194 42.9699 29.3941C41.6336 32.1689 39.6894 34.6069 37.2815 36.5271C34.8737 38.4472 32.0642 39.8002 29.0617 40.4855C26.0592 41.1708 22.9408 41.1708 19.9383 40.4855C16.9358 39.8002 14.1263 38.4472 11.7185 36.5271C9.31063 34.6069 7.36638 32.1689 6.03014 29.3941C4.6939 26.6194 4 23.5792 4 20.4995C4 17.4198 4.6939 14.3796 6.03014 11.6049C7.36638 8.83016 9.31063 6.39214 11.7185 4.47197C14.1263 2.55179 16.9358 1.19879 19.9383 0.51349Z"
											fill="url(#paint8_radial_2283_7309)"
										/>
										<path
											d="M19.9383 0.51349C22.9408 -0.171814 26.0592 -0.171814 29.0617 0.51349C32.0642 1.19879 34.8737 2.55179 37.2815 4.47197C39.6894 6.39214 41.6336 8.83016 42.9699 11.6049C44.3061 14.3796 45 17.4198 45 20.4995C45 23.5792 44.3061 26.6194 42.9699 29.3941C41.6336 32.1689 39.6894 34.6069 37.2815 36.5271C34.8737 38.4472 32.0642 39.8002 29.0617 40.4855C26.0592 41.1708 22.9408 41.1708 19.9383 40.4855C16.9358 39.8002 14.1263 38.4472 11.7185 36.5271C9.31063 34.6069 7.36638 32.1689 6.03014 29.3941C4.6939 26.6194 4 23.5792 4 20.4995C4 17.4198 4.6939 14.3796 6.03014 11.6049C7.36638 8.83016 9.31063 6.39214 11.7185 4.47197C14.1263 2.55179 16.9358 1.19879 19.9383 0.51349Z"
											fill="url(#paint9_radial_2283_7309)"
											fill-opacity="0.5"
										/>
										<path
											d="M19.9383 0.51349C22.9408 -0.171814 26.0592 -0.171814 29.0617 0.51349C32.0642 1.19879 34.8737 2.55179 37.2815 4.47197C39.6894 6.39214 41.6336 8.83016 42.9699 11.6049C44.3061 14.3796 45 17.4198 45 20.4995C45 23.5792 44.3061 26.6194 42.9699 29.3941C41.6336 32.1689 39.6894 34.6069 37.2815 36.5271C34.8737 38.4472 32.0642 39.8002 29.0617 40.4855C26.0592 41.1708 22.9408 41.1708 19.9383 40.4855C16.9358 39.8002 14.1263 38.4472 11.7185 36.5271C9.31063 34.6069 7.36638 32.1689 6.03014 29.3941C4.6939 26.6194 4 23.5792 4 20.4995C4 17.4198 4.6939 14.3796 6.03014 11.6049C7.36638 8.83016 9.31063 6.39214 11.7185 4.47197C14.1263 2.55179 16.9358 1.19879 19.9383 0.51349Z"
											fill="url(#paint10_radial_2283_7309)"
										/>
										<path
											d="M20.8284 4.4132C23.2451 3.86162 25.7549 3.86162 28.1716 4.4132C30.5883 4.96479 32.8496 6.05378 34.7876 7.59929C36.7256 9.1448 38.2905 11.1071 39.366 13.3404C40.4415 15.5738 41 18.0207 41 20.4995C41 22.9783 40.4415 25.4253 39.366 27.6586C38.2905 29.8919 36.7256 31.8542 34.7876 33.3997C32.8496 34.9452 30.5883 36.0342 28.1716 36.5858C25.7549 37.1374 23.2451 37.1374 20.8284 36.5858C18.4117 36.0342 16.1504 34.9452 14.2124 33.3997C12.2744 31.8542 10.7095 29.8919 9.63401 27.6586C8.5585 25.4253 8 22.9783 8 20.4995C8 18.0207 8.5585 15.5738 9.63401 13.3404C10.7095 11.1071 12.2744 9.1448 14.2124 7.59929C16.1504 6.05378 18.4117 4.96479 20.8284 4.4132Z"
											fill="#4633B9"
										/>
										<path
											d="M20.8284 4.4132C23.2451 3.86162 25.7549 3.86162 28.1716 4.4132C30.5883 4.96479 32.8496 6.05378 34.7876 7.59929C36.7256 9.1448 38.2905 11.1071 39.366 13.3404C40.4415 15.5738 41 18.0207 41 20.4995C41 22.9783 40.4415 25.4253 39.366 27.6586C38.2905 29.8919 36.7256 31.8542 34.7876 33.3997C32.8496 34.9452 30.5883 36.0342 28.1716 36.5858C25.7549 37.1374 23.2451 37.1374 20.8284 36.5858C18.4117 36.0342 16.1504 34.9452 14.2124 33.3997C12.2744 31.8542 10.7095 29.8919 9.63401 27.6586C8.5585 25.4253 8 22.9783 8 20.4995C8 18.0207 8.5585 15.5738 9.63401 13.3404C10.7095 11.1071 12.2744 9.1448 14.2124 7.59929C16.1504 6.05378 18.4117 4.96479 20.8284 4.4132Z"
											fill="#1767F9"
										/>
										<path
											d="M20.8284 4.4132C23.2451 3.86162 25.7549 3.86162 28.1716 4.4132C30.5883 4.96479 32.8496 6.05378 34.7876 7.59929C36.7256 9.1448 38.2905 11.1071 39.366 13.3404C40.4415 15.5738 41 18.0207 41 20.4995C41 22.9783 40.4415 25.4253 39.366 27.6586C38.2905 29.8919 36.7256 31.8542 34.7876 33.3997C32.8496 34.9452 30.5883 36.0342 28.1716 36.5858C25.7549 37.1374 23.2451 37.1374 20.8284 36.5858C18.4117 36.0342 16.1504 34.9452 14.2124 33.3997C12.2744 31.8542 10.7095 29.8919 9.63401 27.6586C8.5585 25.4253 8 22.9783 8 20.4995C8 18.0207 8.5585 15.5738 9.63401 13.3404C10.7095 11.1071 12.2744 9.1448 14.2124 7.59929C16.1504 6.05378 18.4117 4.96479 20.8284 4.4132Z"
											fill="#4BB1BC"
										/>
										<path
											d="M20.8284 4.4132C23.2451 3.86162 25.7549 3.86162 28.1716 4.4132C30.5883 4.96479 32.8496 6.05378 34.7876 7.59929C36.7256 9.1448 38.2905 11.1071 39.366 13.3404C40.4415 15.5738 41 18.0207 41 20.4995C41 22.9783 40.4415 25.4253 39.366 27.6586C38.2905 29.8919 36.7256 31.8542 34.7876 33.3997C32.8496 34.9452 30.5883 36.0342 28.1716 36.5858C25.7549 37.1374 23.2451 37.1374 20.8284 36.5858C18.4117 36.0342 16.1504 34.9452 14.2124 33.3997C12.2744 31.8542 10.7095 29.8919 9.63401 27.6586C8.5585 25.4253 8 22.9783 8 20.4995C8 18.0207 8.5585 15.5738 9.63401 13.3404C10.7095 11.1071 12.2744 9.1448 14.2124 7.59929C16.1504 6.05378 18.4117 4.96479 20.8284 4.4132Z"
											fill="url(#paint11_radial_2283_7309)"
										/>
										<path
											d="M20.8284 4.4132C23.2451 3.86162 25.7549 3.86162 28.1716 4.4132C30.5883 4.96479 32.8496 6.05378 34.7876 7.59929C36.7256 9.1448 38.2905 11.1071 39.366 13.3404C40.4415 15.5738 41 18.0207 41 20.4995C41 22.9783 40.4415 25.4253 39.366 27.6586C38.2905 29.8919 36.7256 31.8542 34.7876 33.3997C32.8496 34.9452 30.5883 36.0342 28.1716 36.5858C25.7549 37.1374 23.2451 37.1374 20.8284 36.5858C18.4117 36.0342 16.1504 34.9452 14.2124 33.3997C12.2744 31.8542 10.7095 29.8919 9.63401 27.6586C8.5585 25.4253 8 22.9783 8 20.4995C8 18.0207 8.5585 15.5738 9.63401 13.3404C10.7095 11.1071 12.2744 9.1448 14.2124 7.59929C16.1504 6.05378 18.4117 4.96479 20.8284 4.4132Z"
											fill="url(#paint12_radial_2283_7309)"
											fill-opacity="0.5"
										/>
										<path
											d="M20.8284 4.4132C23.2451 3.86162 25.7549 3.86162 28.1716 4.4132C30.5883 4.96479 32.8496 6.05378 34.7876 7.59929C36.7256 9.1448 38.2905 11.1071 39.366 13.3404C40.4415 15.5738 41 18.0207 41 20.4995C41 22.9783 40.4415 25.4253 39.366 27.6586C38.2905 29.8919 36.7256 31.8542 34.7876 33.3997C32.8496 34.9452 30.5883 36.0342 28.1716 36.5858C25.7549 37.1374 23.2451 37.1374 20.8284 36.5858C18.4117 36.0342 16.1504 34.9452 14.2124 33.3997C12.2744 31.8542 10.7095 29.8919 9.63401 27.6586C8.5585 25.4253 8 22.9783 8 20.4995C8 18.0207 8.5585 15.5738 9.63401 13.3404C10.7095 11.1071 12.2744 9.1448 14.2124 7.59929C16.1504 6.05378 18.4117 4.96479 20.8284 4.4132Z"
											fill="url(#paint13_radial_2283_7309)"
										/>
										<g filter="url(#filter0_d_2283_7309)">
											<path
												d="M25 11.9995L27.8353 17.0971L33.5595 18.2184L29.5876 22.4901L30.2901 28.2807L25 25.8232L19.7099 28.2807L20.4124 22.4901L16.4405 18.2184L22.1647 17.0971L25 11.9995Z"
												fill="#FFDF35"
											/>
										</g>
									</g>
									<defs>
										<filter
											id="filter0_d_2283_7309"
											x="13.4404"
											y="10.9995"
											width="23.1191"
											height="22.2812"
											filterUnits="userSpaceOnUse"
											color-interpolation-filters="sRGB"
										>
											<feFlood flood-opacity="0" result="BackgroundImageFix" />
											<feColorMatrix
												in="SourceAlpha"
												type="matrix"
												values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
												result="hardAlpha"
											/>
											<feOffset dy="2" />
											<feGaussianBlur stdDeviation="1.5" />
											<feColorMatrix
												type="matrix"
												values="0 0 0 0 0.85 0 0 0 0 0.357 0 0 0 0 0 0 0 0 0.5 0"
											/>
											<feBlend
												mode="normal"
												in2="BackgroundImageFix"
												result="effect1_dropShadow_2283_7309"
											/>
											<feBlend
												mode="normal"
												in="SourceGraphic"
												in2="effect1_dropShadow_2283_7309"
												result="shape"
											/>
										</filter>
										<radialGradient
											id="paint0_radial_2283_7309"
											cx="0"
											cy="0"
											r="1"
											gradientUnits="userSpaceOnUse"
											gradientTransform="translate(37.9977 42.747) rotate(97.781) scale(7.47635 9.93427)"
										>
											<stop stop-color="#FF8A1E" />
											<stop offset="1" stop-color="#EF4141" />
										</radialGradient>
										<radialGradient
											id="paint1_radial_2283_7309"
											cx="0"
											cy="0"
											r="1"
											gradientUnits="userSpaceOnUse"
											gradientTransform="translate(35.3292 40.9964) rotate(173.926) scale(17.618 17.4982)"
										>
											<stop stop-color="#FFA901" />
											<stop offset="1" stop-color="#FFC701" stop-opacity="0" />
										</radialGradient>
										<linearGradient
											id="paint2_linear_2283_7309"
											x1="38.9169"
											y1="47.3944"
											x2="36.2889"
											y2="35.3337"
											gradientUnits="userSpaceOnUse"
										>
											<stop stop-color="#FFDF35" />
											<stop offset="1" stop-color="#FF8A01" stop-opacity="0" />
										</linearGradient>
										<linearGradient
											id="paint3_linear_2283_7309"
											x1="38.9168"
											y1="47.3934"
											x2="34.0895"
											y2="36.0518"
											gradientUnits="userSpaceOnUse"
										>
											<stop stop-color="#4DD2E0" />
											<stop offset="1" stop-color="#008493" />
										</linearGradient>
										<radialGradient
											id="paint4_radial_2283_7309"
											cx="0"
											cy="0"
											r="1"
											gradientUnits="userSpaceOnUse"
											gradientTransform="translate(11.4594 42.747) rotate(82.219) scale(7.47635 9.93427)"
										>
											<stop stop-color="#FF8A1E" />
											<stop offset="1" stop-color="#EF4141" />
										</radialGradient>
										<radialGradient
											id="paint5_radial_2283_7309"
											cx="0"
											cy="0"
											r="1"
											gradientUnits="userSpaceOnUse"
											gradientTransform="translate(14.1278 40.9964) rotate(6.07417) scale(17.618 17.4982)"
										>
											<stop stop-color="#FFA901" />
											<stop offset="1" stop-color="#FFC701" stop-opacity="0" />
										</radialGradient>
										<linearGradient
											id="paint6_linear_2283_7309"
											x1="10.5402"
											y1="47.3944"
											x2="13.1681"
											y2="35.3337"
											gradientUnits="userSpaceOnUse"
										>
											<stop stop-color="#FFDF35" />
											<stop offset="1" stop-color="#FF8A01" stop-opacity="0" />
										</linearGradient>
										<linearGradient
											id="paint7_linear_2283_7309"
											x1="10.5402"
											y1="47.3934"
											x2="15.3676"
											y2="36.0518"
											gradientUnits="userSpaceOnUse"
										>
											<stop stop-color="#4DD2E0" />
											<stop offset="1" stop-color="#008493" />
										</linearGradient>
										<radialGradient
											id="paint8_radial_2283_7309"
											cx="0"
											cy="0"
											r="1"
											gradientUnits="userSpaceOnUse"
											gradientTransform="translate(28.7053 30.5123) rotate(116.98) scale(24.7188 29.1727)"
										>
											<stop stop-color="#FF8A1E" />
											<stop offset="1" stop-color="#EF4141" />
										</radialGradient>
										<radialGradient
											id="paint9_radial_2283_7309"
											cx="0"
											cy="0"
											r="1"
											gradientUnits="userSpaceOnUse"
											gradientTransform="translate(24.0549 21) rotate(-156.552) scale(50.3268 59.4743)"
										>
											<stop stop-color="#FFA901" />
											<stop offset="1" stop-color="#FFC701" stop-opacity="0" />
										</radialGradient>
										<radialGradient
											id="paint10_radial_2283_7309"
											cx="0"
											cy="0"
											r="1"
											gradientUnits="userSpaceOnUse"
											gradientTransform="translate(24.0548 18.9974) rotate(-169.487) scale(55.1515 47.4723)"
										>
											<stop stop-color="#FFDF35" />
											<stop offset="1" stop-color="#FF8A01" stop-opacity="0" />
										</radialGradient>
										<radialGradient
											id="paint11_radial_2283_7309"
											cx="0"
											cy="0"
											r="1"
											gradientUnits="userSpaceOnUse"
											gradientTransform="translate(27.8848 28.5586) rotate(116.98) scale(19.8956 23.4805)"
										>
											<stop stop-color="#FF8A1E" />
											<stop offset="1" stop-color="#EF4141" />
										</radialGradient>
										<radialGradient
											id="paint12_radial_2283_7309"
											cx="0"
											cy="0"
											r="1"
											gradientUnits="userSpaceOnUse"
											gradientTransform="translate(24.1417 20.9024) rotate(-156.552) scale(40.5069 47.8696)"
										>
											<stop stop-color="#FFA901" />
											<stop offset="1" stop-color="#FFC701" stop-opacity="0" />
										</radialGradient>
										<radialGradient
											id="paint13_radial_2283_7309"
											cx="0"
											cy="0"
											r="1"
											gradientUnits="userSpaceOnUse"
											gradientTransform="translate(24.1417 19.2905) rotate(-168.579) scale(31.7708 27.347)"
										>
											<stop stop-color="#FFDF35" />
											<stop offset="1" stop-color="#FF8A01" stop-opacity="0" />
										</radialGradient>
										<clipPath id="clip0_2283_7309">
											<rect width="50" height="50" fill="white" />
										</clipPath>
									</defs>
								</svg>
							</v-list-item-avatar>
							<v-list-item-content>
								<v-list-item-title class="text-wrap">
									Работаем на качество уже более 10 лет
								</v-list-item-title>
							</v-list-item-content>
						</v-list-item>
					</v-list>
				</v-row></v-container
			>
		</v-container>
		<v-container>
			<v-row class="my-4">
				<cardList :title="'Лучшая цена'" :name="'bestCost'" />
			</v-row>
			<v-row class="my-4">
				<v-col class="pa-0 pa-md-1">
					<div class="discount__bg">
						<v-list class="discount__content">
							<v-list-item>
								<v-list-item-content>
									<v-list-item-subtitle class="black--text text-center"
										>до 3 августа 2023 года</v-list-item-subtitle
									>
									<v-list-item-title
										class="font-weight-bold black--text text-sm-h5 text-lg-h3 text-center"
										>Скидка 50%</v-list-item-title
									>
									<v-list-item-subtitle
										class="text-overline text-sm-h6 black--text text-center text-wrap"
										>на второй товар встраиваемой техники</v-list-item-subtitle
									>
								</v-list-item-content>
							</v-list-item>
						</v-list>
					</div>
				</v-col>
			</v-row>

			<v-row class="my-4"><cardList :title="'Рекомендуем'" :name="'recommend'" /> </v-row>
			<v-row class="my-4"> <shareSlider :name="'shareSlider'" /> </v-row>
			<v-row class="my-4">
				<div class="wirelessFans">
					<div class="wirelessFans__container">
						<v-list class="transparent d-flex align-center">
							<v-list-item>
								<v-list-item-content>
									<v-list-item-title class="text-h4 mb-2 text-center text-wrap font-weight-bold"
										>Беспроводные вентиляторы</v-list-item-title
									>
									<v-list-item-subtitle
										class="d-flex justify-center mb-2 text-h5 black--text font-weight-regular align-center"
									>
										<img src="@/assets/images/xiaomi.png" class="mr-1 mb-2" width="40" alt="" />
										Xiaomi</v-list-item-subtitle
									>
									<v-list-item-title class="text-center black--text mb-2 text-h5 font-weight-bold"
										>в рассрочку 0 - 0 - 3</v-list-item-title
									>
									<v-list-item-subtitle
										class="text-center black--text text-subtitle-1 font-weight-regular"
										>до 9 мая 2024 года</v-list-item-subtitle
									>
								</v-list-item-content>
							</v-list-item>
						</v-list>
					</div>
				</div>
			</v-row>
			<v-row class="mt-10 justify-space-between" justify-space-between>
				<div class="overflow-x-auto d-flex" style="width: 100%">
					<template v-for="(el, index) in miniItems">
						<v-col cols="7" sm="4" md="3" :key="index">
							<miniCard
								class="miniCard"
								:key="index"
								:title="el.title"
								:subtitle="el.subtitle"
								:subtitle2="el.subtitle2"
								:img="el.img"
								:bg="el.background"
								:messend="el.messends" /></v-col
					></template>
				</div>
			</v-row>
			<v-row class="mt-10">
				<v-col cols="12" md="5">
					<v-list>
						<v-list-item>
							<v-list-item-content>
								<v-list-item-title class="text-h4 font-weight-black text-center mb-2"
									>Бонусные баллы</v-list-item-title
								>
								<v-list-item-subtitle
									class="text-wrap text-subtitle-1 font-weight-regular text-center mb-5"
									><span style="width: 300px" class="d-block mx-auto">
										Бонусная система от Белой техники и Белого Сервиса</span
									></v-list-item-subtitle
								>
								<v-btn
									color="#1BA2B1"
									class="rounded-xxl white--text text-center mb-2 font-weight-medium pa-5"
									>Присоедениться и получить 100 бонусов</v-btn
								>
								<v-btn color="transparent" depressed>узнать подробнее</v-btn>
							</v-list-item-content>
						</v-list-item>
					</v-list>
				</v-col>
				<v-col
					cols="12"
					md="7"
					style="background: #f6f6f6"
					class="rounded-lg d-flex alingn-center pa-4 pt-8"
				>
					<v-list class="transparent">
						<v-row>
							<v-col cols="12" sm="6"
								><v-list-item style="width: 280px">
									<v-list-item-content class="pa-0">
										<div class="d-flex align-center mb-2">
											<svg
												width="25"
												height="33"
												viewBox="0 0 25 33"
												fill="none"
												xmlns="http://www.w3.org/2000/svg"
											>
												<path
													d="M15.7987 31.5386H6.19347C3.32304 31.5386 0.996094 29.2116 0.996094 26.3412V6.73595C0.996094 3.86552 3.32304 1.53857 6.19347 1.53857H15.7987C18.6691 1.53857 20.9961 3.86552 20.9961 6.73595V26.3412C20.9961 29.2116 18.6691 31.5386 15.7987 31.5386Z"
													stroke="black"
													stroke-width="0.86623"
												/>
												<circle cx="15.8574" cy="7.19528" r="0.942857" fill="#4633B9" />
												<circle cx="15.8574" cy="7.19528" r="0.942857" fill="#1767F9" />
												<circle cx="15.8574" cy="7.19528" r="0.942857" fill="#4BB1BC" />
												<circle
													cx="15.8574"
													cy="7.19528"
													r="0.942857"
													stroke="black"
													stroke-width="1.88571"
												/>
											</svg>
											<div class="--ellipseBB ml-2 pa-0">+bb</div>
										</div>
										<v-list-item-title class="font-weight-medium text-subtitle-1 mb-1"
											>Никаких карт и анкет</v-list-item-title
										>
										<v-list-item-subtitle class="text-wrap text-subtitle-2"
											>Начисляем бонусы по номеру телефона</v-list-item-subtitle
										>
									</v-list-item-content></v-list-item
								></v-col
							>
							<v-col cols="12" sm="6"
								><v-list-item style="width: 280px">
									<v-list-item-content class="pa-0">
										<div class="--sumElement"></div>
										<v-list-item-title class="font-weight-medium text-subtitle-1"
											>Никаких карт и анкет</v-list-item-title
										>
										<v-list-item-subtitle class="text-wrap text-subtitle-2"
											>Начисляем бонусы по номеру телефона</v-list-item-subtitle
										>
									</v-list-item-content></v-list-item
								></v-col
							>
							<v-col cols="12" sm="6"
								><v-list-item style="width: 280px">
									<v-list-item-content class="pa-0">
										<div class="d-flex align-center mb-2">
											<svg
												width="40"
												height="28"
												viewBox="0 0 40 28"
												fill="none"
												xmlns="http://www.w3.org/2000/svg"
											>
												<path
													d="M1.01379 27.0589L0.643342 24.8641C0.285181 22.7422 1.681 20.7206 3.79219 20.3037L9.36793 19.2026C9.87634 19.1022 10.3995 19.1022 10.9079 19.2026L15.2069 20.0516"
													stroke="#010101"
												/>
												<path
													d="M3.67188 9.02658C3.67188 6.01034 6.11702 3.56519 9.13327 3.56519H11.4036C14.4198 3.56519 16.8649 6.01033 16.8649 9.02658V11.1184C16.8649 14.1346 14.4198 16.5798 11.4036 16.5798H9.13326C6.11702 16.5798 3.67188 14.1346 3.67188 11.1184V9.02658Z"
													stroke="#010101"
												/>
												<path
													d="M38.8685 27.0588L39.282 24.6087C39.6819 22.2399 38.1236 19.9831 35.7668 19.5177L29.5423 18.2884C28.9747 18.1763 28.3907 18.1763 27.8232 18.2884L21.5987 19.5177C19.2418 19.9831 17.6836 22.2398 18.0834 24.6087L18.497 27.0588"
													stroke="#010101"
												/>
												<path
													d="M21.4053 6.92797C21.4053 3.52865 24.161 0.772949 27.5603 0.772949H30.0948C33.4941 0.772949 36.2498 3.52865 36.2498 6.92797V9.26319C36.2498 12.6625 33.4941 15.4182 30.0947 15.4182H27.5603C24.161 15.4182 21.4053 12.6625 21.4053 9.26318V6.92797Z"
													stroke="#010101"
												/>
											</svg>

											<div class="--ellipseBB ml-2 pa-0">+bb</div>
										</div>
										<v-list-item-title class="font-weight-medium text-subtitle-1 mb-1"
											>Реферальная система</v-list-item-title
										>
										<v-list-item-subtitle class="text-wrap text-subtitle-2"
											>Получите бонусы за каждого приглашенного друга</v-list-item-subtitle
										>
									</v-list-item-content></v-list-item
								></v-col
							>
							<v-col cols="12" sm="6"
								><v-list-item>
									<v-list-item-content class="pa-0">
										<div>
											<span
												style="
													border: 2px solid #ffc530;
													width: 50px;
													height: 32px;
													border-radius: 8px;
												"
												class="d-flex justify-center align-center text-subtile-1 font-weight-medium"
											>
												10%
											</span>
										</div>
										<v-list-item-title class="font-weight-medium text-subtitle-1"
											>Никаких карт и анкет</v-list-item-title
										>
										<v-list-item-subtitle class="text-wrap text-subtitle-2"
											>Начисляем бонусы по номеру телефона</v-list-item-subtitle
										>
									</v-list-item-content></v-list-item
								></v-col
							>
						</v-row>
					</v-list>
				</v-col>
			</v-row>
		</v-container>
	</div>
</template>

<script>
import headerSkider from "@/components/slider/headerSlider.vue";
import shareSlider from "@/components/slider/shareSlider.vue";
import cardList from "@/components/listCard.vue";
import cardItem from "@/components/cardBest.vue";
import miniCard from "../components/items/miniCard.vue";
export default {
	name: "HomePage",
	data() {
		return {
			miniItems: [
				{
					subtitle: "Лучшие цены на ",
					title: "apple",
					img: "img1.png",
					link: "",
					subtitle2: false,
					background: "#ECECEC",
				},

				{
					subtitle: "Программа ",
					title: "бонусов",
					img: "img2.png",
					link: "",
					subtitle2: "до 10% с каждой покупки",
					background: "#F5EBE2",
				},
				{
					subtitle: "Smart часы",
					title: "Amazfit",
					img: "img3.png",
					link: "",
					subtitle2: false,
					background: "#FFB594",
				},
				{
					subtitle: "Новинки ",
					title: "Xiaomi",
					img: "img4.png",
					link: "",
					subtitle2: "2020",
					background: "#FFFFFF",
				},
				{
					subtitle: "Ждем ваши ",
					title: "отзывы",
					img: false,
					messends: ["нам важно мнение каждого", "🤪😍😑"],
					link: "",
					subtitle2: false,
					background: "#FFFFFF",
				},
			],
		};
	},
	components: { headerSkider, cardList, cardItem, shareSlider, miniCard },
};
</script>
<style scoped lang="scss">
.discount__bg {
	background: url("@/assets/images/discountBg.jpg") no-repeat,
		url("@/assets/images/discountBg2.jpg") no-repeat;
	background-size: 40% 100%, 228px 190px;
	background-position: right top, 2em center;
	position: relative;
	height: 260px;
	@media (max-width: 768px) {
		height: 200px;
		padding: 0;
		background-size: 30% 100%, 228px 190px;
		background-position: right top, left bottom;
	}

	@media (max-width: 663px) {
		height: 200px;
		padding: 0;
		background-size: 35% 100%, 93px 76px;
		background-position: right top, left bottom;
	}
}

.discount__content {
	position: absolute;
	background: transparent;
	width: 305px;
	left: 40%;
	top: 50%;
	transform: translate(-34%, -50%);
	@media (max-width: 768px) {
		transform: translate(-24%, -50%);
	}
	@media (max-width: 663px) {
		transform: translate(-44%, -50%);
		width: 210px;
	}
}
.wirelessFans {
	height: 290px;
	width: 100%;

	background-image: url("@/assets/images/wireless/image1.jpg"),
		url("@/assets/images/wireless/image2.jpg");
	background-size: 55% 100%, 25% 100%;
	background-position: 0 0, right top;
	display: flex;
	justify-content: center;
	@media (max-width: 600px) {
		& {
			background-image: #040;
		}
	}
}
.wirelessFans__container {
	width: 30%;
	background: #f5f7f8;
	transform: translateX(40%);
	display: flex;
	align-items: center;
	@media (max-width: 600px) {
		& {
			width: 100%;
			transform: translateX(0%);
		}
	}
}
</style>
<style lang="scss">
.miniCard:nth-child(2) {
	& > .miniCard-span--help {
		display: block;
		position: absolute;
		right: 0;
		margin-top: -6px;

		width: 83px;
		height: 29px;
		background: #fff;
		border-radius: 20px;

		&::before {
			position: absolute;
			width: 100%;
			text-align: center;
			top: 50%;
			left: 50%;
			transform: translate(-50%, -50%);
			content: "1bb =1p";
			z-index: 2;
		}
		&::after {
			content: "";
			width: 25px;
			height: 30px;
			z-index: 1;
			background: inherit;
			transform: rotate(45deg);
			position: absolute;
			bottom: -4px;
			left: 12px;
		}
	}
}
.--ellipseBB {
	width: 36px;
	height: 25px;
	background: #ffc530;
	border-radius: 4px;
	display: flex;
	justify-content: center;
	align-items: center;
	overflow: visible;
	position: relative;
	z-index: 2;
	&::before {
		content: "";
		position: absolute;
		width: 15px;
		height: 15px;
		z-index: -1;
		background: inherit;
		left: -5px;
		border-radius: 99% 0 0 100%/58% 0 0 56%;
	}
}
.--sumElement {
	width: 30px;
	height: 30px;
	&:before {
		content: "";
		display: block;
		width: 15px;
		height: 15px;
		margin-left: 20px;
		background-color: #000;
		box-shadow: 0 0 1px 10px #000;
		position: absolute;
		border-radius: 50%;
	}
	&:after {
		content: "";
		display: block;
		width: 15px;
		position: absolute;
		height: 15px;
		margin-left: 20px;
		background-color: #e2e1e1;
	}
}
</style>
